module.exports = [
    {
        title: "Scala 基础-语言特征",
        collapsable: false,
        sidebarDepth: 1,
        children: [
            ["Scala-语言特征概述", "Scala-语言特征概述"],
            ["基础知识", "基础知识"],
            ['统一类型', '统一类型'],
            ['类', '类'],
            ['案例类', '案例类'],
            ['特质', '特质'],
            ['元组', '元组'],
            ['混入组合类', '混入组合类'],
            ['高阶函数', '高阶函数'],
            ['柯里化', '柯里化'],
            ['模式匹配', '模式匹配'],
            ['正则表达式', '正则表达式'],
            ['提取器对象', '提取器对象'],
            ['For表达式', 'For表达式'],
            ['泛型类', '泛型类'],
            ['型变', '型变'],
            ['内部类', '内部类'],
            ['抽象类型', '抽象类型'],
            ['复合类型', '复合类型'],
            ['自类型', '自类型'],
            ['隐式参数', '隐式参数'],
            ['隐式转换', '隐式转换'],
            ['多态方法', '多态方法'],
            ['注解', '注解'],
            ['包和导入', '包和导入'],
            ['包对象', '包对象']
        ]
    }
];